#### Terraform Workspace 🛠️`sausage`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-sausage/runs/run-Fme88fPqPcDnjmps

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
openstack_compute_keypair_v2.bastion: Refreshing state... [id=sausage-bastion]
openstack_compute_floatingip_associate_v2.bastion: Refreshing state... [id=193.16.42.80/ad184c91-7db6-4db5-b503-9bb81079caee/]
openstack_networking_port_v2.bastion: Refreshing state... [id=89c8f25f-3bea-4900-9506-b23b60622543]
openstack_compute_instance_v2.bastion: Refreshing state... [id=ad184c91-7db6-4db5-b503-9bb81079caee]
null_resource.unattended-upgrades: Refreshing state... [id=7997623724640190265]
null_resource.sudoers["bharat"]: Refreshing state... [id=3169999628379293414]
null_resource.users["steveb"]: Refreshing state... [id=926830677490972571]
null_resource.users["pierre"]: Refreshing state... [id=3506786981165295107]
null_resource.users["matt"]: Refreshing state... [id=7054035877974170974]
null_resource.users["bharat"]: Refreshing state... [id=3005788667936463191]
null_resource.users["michal"]: Refreshing state... [id=557136424674485923]
null_resource.users["isaac"]: Refreshing state... [id=3933815550887916823]
null_resource.users["bartosz"]: Refreshing state... [id=5482831289532090562]
null_resource.users["mark"]: Refreshing state... [id=2115458144934064897]
null_resource.users["piotr"]: Refreshing state... [id=8302577004424375532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # null_resource.host-key will be created
  + resource "null_resource" "host-key" {
      + id       = (known after apply)
      + triggers = {
          + "host"        = "193.16.42.80"
          + "host_keys"   = (sensitive)
          + "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          + "private_key" = (sensitive)
          + "user"        = "ubuntu"
        }
    }

  # null_resource.mosh will be created
  + resource "null_resource" "mosh" {
      + id       = (known after apply)
      + triggers = {
          + "host"        = "193.16.42.80"
          + "instance"    = "ad184c91-7db6-4db5-b503-9bb81079caee"
          + "private_key" = (sensitive)
          + "user"        = "ubuntu"
        }
    }

  # openstack_compute_floatingip_associate_v2.bastion will be destroyed
  - resource "openstack_compute_floatingip_associate_v2" "bastion" {
      - floating_ip = "193.16.42.80" -> null
      - id          = "193.16.42.80/ad184c91-7db6-4db5-b503-9bb81079caee/" -> null
      - instance_id = "ad184c91-7db6-4db5-b503-9bb81079caee" -> null
      - region      = "Bunker" -> null
    }

  # openstack_networking_floatingip_associate_v2.bastion will be created
  + resource "openstack_networking_floatingip_associate_v2" "bastion" {
      + fixed_ip    = (known after apply)
      + floating_ip = "193.16.42.80"
      + id          = (known after apply)
      + port_id     = "89c8f25f-3bea-4900-9506-b23b60622543"
      + region      = (known after apply)
    }

  # openstack_networking_port_v2.bastion will be updated in-place
  ~ resource "openstack_networking_port_v2" "bastion" {
        id                     = "89c8f25f-3bea-4900-9506-b23b60622543"
        name                   = "sausage-bastion"
      + security_group_ids     = (known after apply)
        tags                   = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # openstack_networking_secgroup_rule_v2.icmp will be created
  + resource "openstack_networking_secgroup_rule_v2" "icmp" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = "icmp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.mosh will be created
  + resource "openstack_networking_secgroup_rule_v2" "mosh" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 61000
      + port_range_min    = 60000
      + protocol          = "udp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ssh will be created
  + resource "openstack_networking_secgroup_rule_v2" "ssh" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 22
      + port_range_min    = 22
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_v2.bastion will be created
  + resource "openstack_networking_secgroup_v2" "bastion" {
      + all_tags    = (known after apply)
      + description = "Bastion security group"
      + id          = (known after apply)
      + name        = "sausage-bastion"
      + region      = (known after apply)
      + tenant_id   = (known after apply)
    }

Plan: 7 to add, 1 to change, 1 to destroy.

```

</details>

#### Author ✍️@brtknr